; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=34, remove_proportion=0.101, bases=13, instance_id=9, output=./training, seed=50

(define (problem warehouse-09)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 - base
    )
    (:init
        (to-remove box18)
        (to-remove box24)
        (to-remove box32)
        (clear-base base1)
        (clear box27)
        (on box27 box16)
        (on box16 box28)
        (on box28 box13)
        (on box13 box7)
        (on box7 box21)
        (on-base box21 base2)
        (clear box14)
        (on-base box14 base3)
        (clear box10)
        (on box10 box2)
        (on box2 box19)
        (on box19 box20)
        (on-base box20 base4)
        (clear-base base5)
        (clear box18)
        (on box18 box31)
        (on box31 box6)
        (on box6 box22)
        (on box22 box15)
        (on box15 box17)
        (on box17 box9)
        (on-base box9 base6)
        (clear box25)
        (on-base box25 base7)
        (clear box4)
        (on-base box4 base8)
        (clear box12)
        (on box12 box8)
        (on-base box8 base9)
        (clear box24)
        (on box24 box23)
        (on box23 box30)
        (on-base box30 base10)
        (clear box11)
        (on box11 box1)
        (on box1 box26)
        (on box26 box34)
        (on-base box34 base11)
        (clear box3)
        (on box3 box29)
        (on box29 box33)
        (on-base box33 base12)
        (clear box5)
        (on box5 box32)
        (on-base box32 base13)
    )
    (:goal (and 
        (removed box18)
        (removed box24)
        (removed box32)
    ))
)

; plan
1. (move box5 box32 box10)
   deleted: (clear box10) (on box5 box32)
   added: (on box5 box10) (clear box32)
   goals met: 0 of 3
2. (remove box18 box31)
   deleted: (on box18 box31) (clear box18)
   added: (removed box18) (clear box31)
   goals met: 1 of 3
3. (remove box24 box23)
   deleted: (on box24 box23) (clear box24)
   added: (removed box24) (clear box23)
   goals met: 2 of 3
4. (remove-from-base box32 base13)
   deleted: (on-base box32 base13) (clear box32)
   added: (removed box32) (clear-base base13)
   goals met: 3 of 3
